STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tamp.h
/** @defgroup TAMP_LL_EC_TAMPER_PULL_UP TAMPER PULL UP
  * @{
  */
#define LL_TAMP_PULL_UP_ENABLE        0U                    /*!< Precharge TAMP_INx pins before sampling (enable internal pull-up) */
#define LL_TAMP_PULL_UP_DISABLE       TAMP_FLTCR_TAMPPUDIS  /*!< Disable precharge of TAMP_INx pins                                */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_ACTIVELEVEL  TAMPER ACTIVE LEVEL
  * @{
  */
#define LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL  0U
#define LL_TAMP_ACTIVELEVEL_TAMP            TAMP_CR2_TAMP1TRG /*!< Tamper 1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP1    TAMP_CR2_TAMP1TRG /*!< Tamper 1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP2    TAMP_CR2_TAMP2TRG /*!< Tamper 2 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP3    TAMP_CR2_TAMP3TRG /*!< Tamper 3 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP4    TAMP_CR2_TAMP4TRG /*!< Tamper 4 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP5    TAMP_CR2_TAMP5TRG /*!< Tamper 5 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP6    TAMP_CR2_TAMP6TRG /*!< Tamper 6 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP7    TAMP_CR2_TAMP7TRG /*!< Tamper 7 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP8    TAMP_CR2_TAMP8TRG /*!< Tamper 8 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_TAMP_ACTIVELEVEL_TAMP_ALL (TAMP_CR2_TAMP1TRG | TAMP_CR2_TAMP2TRG | TAMP_CR2_TAMP3TRG \
                                      | TAMP_CR2_TAMP4TRG | TAMP_CR2_TAMP5TRG | TAMP_CR2_TAMP6TRG \
                                      | TAMP_CR2_TAMP7TRG | TAMP_CR2_TAMP8TRG) /*!< All tamper input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
/**
  * @}
  */


/** @defgroup TAMP_LL_EC_INTERNAL  INTERNAL TAMPER
  * @{
  */
#define LL_TAMP_ITAMP1                TAMP_CR1_ITAMP1E  /*!< Internal tamper 1: RTC supply voltage monitoring */
#define LL_TAMP_ITAMP2                TAMP_CR1_ITAMP2E  /*!< Internal tamper 2: Temperature monitoring */
#define LL_TAMP_ITAMP3                TAMP_CR1_ITAMP3E  /*!< Internal tamper 3: LSE monitoring */
#define LL_TAMP_ITAMP5                TAMP_CR1_ITAMP5E  /*!< Internal tamper 5: RTC calendar overflow */
#define LL_TAMP_ITAMP6                TAMP_CR1_ITAMP6E  /*!< Internal tamper 6: JTAG/SWD access when RDP > 0 */
#define LL_TAMP_ITAMP7                TAMP_CR1_ITAMP7E  /*!< Internal tamper 7: ADC4 analog watchdog monitoring 1 */
#define LL_TAMP_ITAMP8                TAMP_CR1_ITAMP8E  /*!< Internal tamper 8: Monotonic counter overflow */
#define LL_TAMP_ITAMP9                TAMP_CR1_ITAMP9E  /*!< Internal tamper 9: Cryptographic IPs fault*/
#define LL_TAMP_ITAMP11               TAMP_CR1_ITAMP11E /*!< Internal tamper 11: IWDG reset when tamper flag is set */
#define LL_TAMP_ITAMP12               TAMP_CR1_ITAMP12E /*!< Internal tamper 12: ADC4 analog watchdog monitoring 2*/
#define LL_TAMP_ITAMP13               TAMP_CR1_ITAMP13E /*!< Internal tamper 13: ADC4 analog watchdog monitoring 3 */
#define LL_TAMP_ITAMP_ALL             (TAMP_CR1_ITAMP1E | TAMP_CR1_ITAMP2E | TAMP_CR1_ITAMP3E \
                                       | TAMP_CR1_ITAMP5E | TAMP_CR1_ITAMP6E | TAMP_CR1_ITAMP7E \
                                       | TAMP_CR1_ITAMP8E | TAMP_CR1_ITAMP9E | TAMP_CR1_ITAMP11E \
                                       | TAMP_CR1_ITAMP12E | TAMP_CR1_ITAMP13E) /*!< All internal tampers */
/**
  * @}
  */

/**
  * @defgroup TAMP_LL_EC_INTERNAL_MODE INTERNAL TAMPER MODE
  * @{
  */
#define LL_TAMP_ITAMP_ERASE_ACTIVE_ALL    0U
#define LL_TAMP_ITAMP_NOERASE_TAMPER      TAMP_CR3_ITAMP1NOER  /*!< Internal tamper 1 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER1     TAMP_CR3_ITAMP1NOER  /*!< Internal tamper 1 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER2     TAMP_CR3_ITAMP2NOER  /*!< Internal tamper 2 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER3     TAMP_CR3_ITAMP3NOER  /*!< Internal tamper 3 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER5     TAMP_CR3_ITAMP5NOER  /*!< Internal tamper 5 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER6     TAMP_CR3_ITAMP6NOER  /*!< Internal tamper 6 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER7     TAMP_CR3_ITAMP7NOER  /*!< Internal tamper 7 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER8     TAMP_CR3_ITAMP8NOER  /*!< Internal tamper 8 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER9     TAMP_CR3_ITAMP9NOER  /*!< Internal tamper 9 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER11    TAMP_CR3_ITAMP11NOER /*!< Internal tamper 11 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER12    TAMP_CR3_ITAMP12NOER /*!< Internal tamper 12 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER13    TAMP_CR3_ITAMP13NOER /*!< Internal tamper 13 potential mode */
#define LL_TAMP_ITAMP_NOERASE_TAMPER_ALL  (TAMP_CR3_ITAMP1NOER | TAMP_CR3_ITAMP2NOER | TAMP_CR3_ITAMP3NOER \
                                           | TAMP_CR3_ITAMP5NOER | TAMP_CR3_ITAMP6NOER | TAMP_CR3_ITAMP7NOER \
                                           | TAMP_CR3_ITAMP8NOER | TAMP_CR3_ITAMP9NOER | TAMP_CR3_ITAMP11NOER \
                                           | TAMP_CR3_ITAMP12NOER | TAMP_CR3_ITAMP13NOER)
/*!< All internal tampers events do not erase the device secrets. */

/**
  * @}
  */

/** @defgroup TAMP_LL_EC_ACTIVE_MODE   ACTIVE TAMPER MODE
  * @{
  */
#define LL_TAMP_ATAMP_TAMP1AM               TAMP_ATCR1_TAMP1AM /*!< tamper 1 is active */
#define LL_TAMP_ATAMP_TAMP2AM               TAMP_ATCR1_TAMP2AM /*!< tamper 2 is active */
#define LL_TAMP_ATAMP_TAMP3AM               TAMP_ATCR1_TAMP3AM /*!< tamper 3 is active */
#define LL_TAMP_ATAMP_TAMP4AM               TAMP_ATCR1_TAMP4AM /*!< tamper 4 is active */
#define LL_TAMP_ATAMP_TAMP5AM               TAMP_ATCR1_TAMP5AM /*!< tamper 5 is active */
#define LL_TAMP_ATAMP_TAMP6AM               TAMP_ATCR1_TAMP6AM /*!< tamper 6 is active */
#define LL_TAMP_ATAMP_TAMP7AM               TAMP_ATCR1_TAMP7AM /*!< tamper 7 is active */
#define LL_TAMP_ATAMP_TAMP8AM               TAMP_ATCR1_TAMP8AM /*!< tamper 8 is active */
#define LL_TAMP_ATAMP_TAMPAM_ALL            (TAMP_ATCR1_TAMP1AM | TAMP_ATCR1_TAMP2AM | TAMP_ATCR1_TAMP3AM \
                                             | TAMP_ATCR1_TAMP4AM | TAMP_ATCR1_TAMP5AM | TAMP_ATCR1_TAMP6AM \
                                             | TAMP_ATCR1_TAMP7AM | TAMP_ATCR1_TAMP8AM)
/*!< All tampers are active */
/**
  * @}
  */

