STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tamp.h
/** @defgroup TAMP_LL_EC_TAMPER_ATCR1_REGISTER_ACTIVE_TAMP_OUTPUT_PERIOD  Active TAMPER output period
  * @{
  */
#define LL_TAMP_OUTPUT_PERIOD  (TAMP_ATCR1_ATPER_Msk >> TAMP_ATCR1_ATPER_Pos) /*!< Active tamper output period */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_ACTIVE_ASYNC_PRESCALER   ACTIVE TAMPER ASYNCHRONOUS PRESCALER CLOCK
  * @{
  */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK       0U                                                                      /*!< RTCCLK     */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2     TAMP_ATCR1_ATCKSEL_0                                                    /*!< RTCCLK/2   */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_4     TAMP_ATCR1_ATCKSEL_1                                                    /*!< RTCCLK/4   */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_8     (TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)                           /*!< RTCCLK/8   */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_16    TAMP_ATCR1_ATCKSEL_2                                                    /*!< RTCCLK/16  */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_32    (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_0)                           /*!< RTCCLK/32  */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_64    (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_1)                           /*!< RTCCLK/64  */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_128   (TAMP_ATCR1_ATCKSEL_2 | TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)    /*!< RTCCLK/128 */
#define LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2048  (TAMP_ATCR1_ATCKSEL_3 | TAMP_ATCR1_ATCKSEL_1 | TAMP_ATCR1_ATCKSEL_0)    /*!< RTCCLK/2048 */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_ACTIVE_FILTERING ACTIVE TAMPER FILTERING
  * @{
  */
#define LL_TAMP_ATAMP_FILTERING_DISABLE  0U                      /*!< Active tamper filtering disable */
#define LL_TAMP_ATAMP_FILTERING_ENABLE   TAMP_ATCR1_FLTEN        /*!< Active tamper filter enable     */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_ACTIVE_SHARING ACTIVE TAMPER SHARING
  * @{
  */
#define LL_TAMP_ATAMP_SHARING_DISABLE     0U                     /*!< Each active tamper input TAMP_INi is compared with its dedicated output TAMP_OUTi */
#define LL_TAMP_ATAMP_SHARING_ENABLE      TAMP_ATCR1_ATOSHARE    /*!< Each active tamper input TAMP_INi is compared with TAMPOUTSELi defined by ATOSELi bits. */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_ACTIVE_OUTPUT_SELECTION   ACTIVE TAMPER OUTPUT SELECTION
  * @{
  */
#define TAMP_ATCR2_ATOSEL_MSK       (TAMP_ATCR2_ATOSEL1 | TAMP_ATCR2_ATOSEL2 | TAMP_ATCR2_ATOSEL3 |\
                                     TAMP_ATCR2_ATOSEL4 | TAMP_ATCR2_ATOSEL5 | TAMP_ATCR2_ATOSEL6 |\
                                     TAMP_ATCR2_ATOSEL7 | TAMP_ATCR2_ATOSEL8)

#define LL_TAMP_ATAMP1IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP1IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP1IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP1IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP1IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP1IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP1IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP1IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL1_Pos) /*!< Active tamper 1 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP2IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP2IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP2IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP2IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP2IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP2IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP2IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP2IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL2_Pos) /*!< Active tamper 2 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP3IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP3IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP3IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP3IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP3IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP3IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP3IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP3IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL3_Pos) /*!< Active tamper 3 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP4IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP4IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP4IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP4IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP4IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP4IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP4IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP4IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL4_Pos) /*!< Active tamper 4 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP5IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP5IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP5IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP5IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP5IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP5IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP5IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP5IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL5_Pos) /*!< Active tamper 5 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP6IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP6IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP6IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP6IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP6IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP6IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP6IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP6IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL6_Pos) /*!< Active tamper 6 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP7IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP7IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP7IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP7IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP7IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP7IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP7IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP7IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL7_Pos) /*!< Active tamper 7 output is set to TAMP_OUT8 */

#define LL_TAMP_ATAMP8IN_ATAMP1OUT  (0U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT1 */
#define LL_TAMP_ATAMP8IN_ATAMP2OUT  (1U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT2 */
#define LL_TAMP_ATAMP8IN_ATAMP3OUT  (2U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT3 */
#define LL_TAMP_ATAMP8IN_ATAMP4OUT  (3U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT4 */
#define LL_TAMP_ATAMP8IN_ATAMP5OUT  (4U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT5 */
#define LL_TAMP_ATAMP8IN_ATAMP6OUT  (5U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT6 */
#define LL_TAMP_ATAMP8IN_ATAMP7OUT  (6U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT7 */
#define LL_TAMP_ATAMP8IN_ATAMP8OUT  (7U << TAMP_ATCR2_ATOSEL8_Pos) /*!< Active tamper 8 output is set to TAMP_OUT8 */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_TAMPER_IT TAMPER IT
  * @{
  */
#define LL_TAMP_IT_NONE         0U
#define LL_TAMP_IT_TAMPER_1     TAMP_IER_TAMP1IE /*!< Tamper 1 interrupt enable */
#define LL_TAMP_IT_TAMPER_2     TAMP_IER_TAMP2IE /*!< Tamper 2 interrupt enable */
#define LL_TAMP_IT_TAMPER_3     TAMP_IER_TAMP3IE /*!< Tamper 3 interrupt enable */
#define LL_TAMP_IT_TAMPER_4     TAMP_IER_TAMP4IE /*!< Tamper 4 interrupt enable */
#define LL_TAMP_IT_TAMPER_5     TAMP_IER_TAMP5IE /*!< Tamper 5 interrupt enable */
#define LL_TAMP_IT_TAMPER_6     TAMP_IER_TAMP6IE /*!< Tamper 6 interrupt enable */
#define LL_TAMP_IT_TAMPER_7     TAMP_IER_TAMP7IE /*!< Tamper 7 interrupt enable */
#define LL_TAMP_IT_TAMPER_8     TAMP_IER_TAMP8IE /*!< Tamper 8 interrupt enable */
#define LL_TAMP_IT_ALL          (TAMP_IER_TAMP1IE | TAMP_IER_TAMP2IE \
                                 | TAMP_IER_TAMP3IE | TAMP_IER_TAMP4IE \
                                 | TAMP_IER_TAMP5IE | TAMP_IER_TAMP6IE \
                                 | TAMP_IER_TAMP7IE | TAMP_IER_TAMP8IE)
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_INTERNAL_TAMPER_IT INTERNAL TAMPER IT
  * @{
  */
#define LL_TAMP_INTERNAL_IT_NONE         0U
#define LL_TAMP_INTERNAL_IT_TAMPER_1    TAMP_IER_ITAMP1IE  /*!< Internal tamper 1 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_2    TAMP_IER_ITAMP2IE  /*!< Internal tamper 2 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_3    TAMP_IER_ITAMP3IE  /*!< Internal tamper 3 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_5    TAMP_IER_ITAMP5IE  /*!< Internal tamper 5 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_6    TAMP_IER_ITAMP6IE  /*!< Internal tamper 6 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_7    TAMP_IER_ITAMP7IE  /*!< Internal tamper 7 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_8    TAMP_IER_ITAMP8IE  /*!< Internal tamper 8 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_9    TAMP_IER_ITAMP9IE  /*!< Internal tamper 9 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_11   TAMP_IER_ITAMP11IE /*!< Internal tamper 11 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_12   TAMP_IER_ITAMP12IE /*!< Internal tamper 12 interrupt enable */
#define LL_TAMP_INTERNAL_IT_TAMPER_13   TAMP_IER_ITAMP13IE /*!< Internal tamper 13 interrupt enable */
#define LL_TAMP_INTERNAL_IT_ALL         (TAMP_IER_ITAMP1IE  | TAMP_IER_ITAMP2IE | TAMP_IER_ITAMP3IE \
                                         | TAMP_IER_ITAMP5IE  | TAMP_IER_ITAMP6IE | TAMP_IER_ITAMP7IE \
                                         | TAMP_IER_ITAMP8IE  | TAMP_IER_ITAMP9IE | TAMP_IER_ITAMP11IE \
                                         | TAMP_IER_ITAMP12IE | TAMP_IER_ITAMP13IE)
/**
  * @}
  */

