STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tamp.h
/** @defgroup TAMP_LL_EC_RESOURCE_PROTECTION RESOURCE PROTECTION
  * @{
  */
#define LL_TAMP_RESOURCE_0        TAMP_ERCFGR0
#define LL_TAMP_RESOURCES_ALL    (LL_TAMP_RESOURCE_0)
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_BKP  BACKUP REGISTER
  * @{
  */
#define LL_TAMP_BKP_NUMBER                  TAMP_BACKUP_NB /*!< TAMP backup registers number */
#define LL_TAMP_BKP_DR0                     0U /*!< TAMP backup registers 0 */
#define LL_TAMP_BKP_DR1                     1U /*!< TAMP backup registers 1 */
#define LL_TAMP_BKP_DR2                     2U /*!< TAMP backup registers 2 */
#define LL_TAMP_BKP_DR3                     3U /*!< TAMP backup registers 3 */
#define LL_TAMP_BKP_DR4                     4U /*!< TAMP backup registers 4 */
#define LL_TAMP_BKP_DR5                     5U /*!< TAMP backup registers 5 */
#define LL_TAMP_BKP_DR6                     6U /*!< TAMP backup registers 6 */
#define LL_TAMP_BKP_DR7                     7U /*!< TAMP backup registers 7 */
#define LL_TAMP_BKP_DR8                     8U   /*!< TAMP backup registers 8 */
#define LL_TAMP_BKP_DR9                     9U   /*!< TAMP backup registers 9 */
#define LL_TAMP_BKP_DR10                    10U  /*!< TAMP backup registers 10 */
#define LL_TAMP_BKP_DR11                    11U  /*!< TAMP backup registers 11 */
#define LL_TAMP_BKP_DR12                    12U  /*!< TAMP backup registers 12 */
#define LL_TAMP_BKP_DR13                    13U  /*!< TAMP backup registers 13 */
#define LL_TAMP_BKP_DR14                    14U  /*!< TAMP backup registers 14 */
#define LL_TAMP_BKP_DR15                    15U  /*!< TAMP backup registers 15 */
#define LL_TAMP_BKP_DR16                    16U  /*!< TAMP backup registers 16 */
#define LL_TAMP_BKP_DR17                    17U  /*!< TAMP backup registers 17 */
#define LL_TAMP_BKP_DR18                    18U  /*!< TAMP backup registers 18 */
#define LL_TAMP_BKP_DR19                    19U  /*!< TAMP backup registers 19 */
#define LL_TAMP_BKP_DR20                    20U  /*!< TAMP backup registers 20 */
#define LL_TAMP_BKP_DR21                    21U  /*!< TAMP backup registers 21 */
#define LL_TAMP_BKP_DR22                    22U  /*!< TAMP backup registers 22 */
#define LL_TAMP_BKP_DR23                    23U  /*!< TAMP backup registers 23 */
#define LL_TAMP_BKP_DR24                    24U  /*!< TAMP backup registers 24 */
#define LL_TAMP_BKP_DR25                    25U  /*!< TAMP backup registers 25 */
#define LL_TAMP_BKP_DR26                    26U  /*!< TAMP backup registers 26 */
#define LL_TAMP_BKP_DR27                    27U  /*!< TAMP backup registers 27 */
#define LL_TAMP_BKP_DR28                    28U  /*!< TAMP backup registers 28 */
#define LL_TAMP_BKP_DR29                    29U  /*!< TAMP backup registers 29 */
#define LL_TAMP_BKP_DR30                    30U  /*!< TAMP backup registers 30 */
#define LL_TAMP_BKP_DR31                    31U  /*!< TAMP backup registers 31 */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_SECURE_TAMP  Secure tamp
  * @{
  */
#define LL_TAMP_SECURE_FULL_YES            TAMP_SECCFGR_TAMPSEC  /*!< TAMP full secure */
#define LL_TAMP_SECURE_FULL_NO             0U                    /*!< TAMP is not secure */
/**
  * @}
  */


/** @defgroup TAMP_LL_EC_SECURE_MONO_CNT_1  Secure Monotonic counter 1
  * @{
  */
#define LL_TAMP_MONO_CNT_1_SECURE_YES      TAMP_SECCFGR_CNT1SEC  /*!< Monotonic counter 1 secure */
#define LL_TAMP_MONO_CNT_1_SECURE_NO       0U                    /*!< Monotonic counter 1 is not secure */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_PRIVILEGE_TAMP_FULL  Privilege full tamp
  * @{
  */
#define LL_TAMP_PRIVILEGE_FULL_YES         TAMP_PRIVCFGR_TAMPPRIV /*!< TAMP full privilege */
#define LL_TAMP_PRIVILEGE_FULL_NO          0U                     /*!< TAMP is not privilege */
/**
  * @}
  */


/** @defgroup TAMP_LL_EC_PRIVILEGE_MONO_CNT_1  Privilege Monotonic counter 1
  * @{
  */
#define LL_TAMP_MONO_CNT_1_PRIVILEGE_YES   TAMP_PRIVCFGR_CNT1SEC  /*!< Monotonic counter 1 privilege */
#define LL_TAMP_MONO_CNT_1_PRIVILEGE_NO    0U                    /*!< Monotonic counter 1 is not privilege */
/**
  * @}
  */

/** @defgroup TAMP_LL_EC_PRIVILEGE_BACKUP_REG_ZONE  Privilege Backup register privilege zone
  * @{
  */
#define LL_TAMP_PRIVILEGE_BKUP_ZONE_NONE    0U /*!< Backup registers no privilege protection */
#define LL_TAMP_PRIVILEGE_BKUP_ZONE_1       TAMP_PRIVCFGR_BKPRWPRIV /*!< Backup registers zone 1 privilege protection */
#define LL_TAMP_PRIVILEGE_BKUP_ZONE_2       TAMP_PRIVCFGR_BKPWPRIV  /*!< Backup registers zone 2 privilege protection */
#define LL_TAMP_PRIVILEGE_BKUP_ZONE_ALL     (LL_TAMP_PRIVILEGE_BKUP_ZONE_1 |  LL_TAMP_PRIVILEGE_BKUP_ZONE_2)
/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TAMP_LL_Exported_Macros TAMP Exported Macros
  * @{
  */

/** @defgroup TAMP_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */


/**
  * @brief  Write a value in TAMP register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  */
#define LL_TAMP_WRITE_REG(__REG__, __VALUE__) WRITE_REG(TAMP->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TAMP register

  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_TAMP_READ_REG(__REG__) READ_REG(TAMP->__REG__)
/**
  * @}
  */

/** @defgroup TAMP_LL_EM_helper Helper macros
  * @{
  */

/**
  * @brief Helper macro to retrieve pull_up precharge configuration
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_PULL_UP_ENABLE
  *        @arg @ref LL_TAMP_PULL_UP_DISABLE
  */
#define LL_TAMP_GET_PULL_UP(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPPUDIS)

/**
  * @brief Helper macro to retrieve pull_up precharge duration configuration
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_DURATION_1RTCCLK
  *        @arg @ref LL_TAMP_DURATION_2RTCCLK
  *        @arg @ref LL_TAMP_DURATION_4RTCCLK
  *        @arg @ref LL_TAMP_DURATION_8RTCCLK
  */
#define LL_TAMP_GET_PRECHARGE_DURATION(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPPRCH)

/**
  * @brief Helper macro to retrieve pull_up precharge configuration
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_FILTER_DISABLE
  *        @arg @ref LL_TAMP_FILTER_2SAMPLES
  *        @arg @ref LL_TAMP_FILTER_4SAMPLES
  *        @arg @ref LL_TAMP_FILTER_8SAMPLES
  */
#define LL_TAMP_GET_FILTER_SAMPLE(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPFLT)

/**
  * @brief Helper macro to retrieve pull_up precharge configuration
  * @param tamp_config_value Value returned by @ref LL_TAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_32768
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_16384
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_8192
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_4096
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_2048
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_1024
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_512
  *        @arg @ref LL_TAMP_SAMPLFREQDIV_256
  */
#define LL_TAMP_GET_FILTER_SAMPLE_FREQUENCY(tamp_config_value) ((tamp_config_value) & TAMP_FLTCR_TAMPFREQ)

/**
  * @brief Helper macro to retrieve the trigger edge or level.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL
  *         @arg @ref LL_TAMP_ACTIVELEVEL_TAMP
  */
#define LL_TAMP_GET_TRIGGER(tamp_config_indiv_value) ((((tamp_config_indiv_value) & \
                                                        LL_TAMP_ACTIVELEVEL_TAMP_ALL) != 0U ) ?\
                                                      LL_TAMP_ACTIVELEVEL_TAMP : LL_TAMP_ACTIVELEVEL_DEACTIVATE_ALL)

/**
  * @brief Helper macro to retrieve the mode of the tamper.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ERASE_ACTIVATE_ALL
  *         @arg @ref LL_TAMP_NOERASE_TAMPER
  */
#define LL_TAMP_GET_NOERASE(tamp_config_indiv_value) ((((tamp_config_indiv_value) &\
                                                        LL_TAMP_NOERASE_TAMPER_ALL) != 0U ) ?\
                                                      LL_TAMP_NOERASE_TAMPER : LL_TAMP_ERASE_ACTIVATE_ALL)

/**
  * @brief Helper macro to retrieve the mask of the tamper.
  * @param tamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_MASK_NONE
  *         @arg @ref LL_TAMP_MASK_TAMPER
  */
#define LL_TAMP_GET_MASK(tamp_config_indiv_value) ((((tamp_config_indiv_value) &\
                                                     LL_TAMP_MASK_TAMPER_ALL) != 0U ) ?\
                                                   LL_TAMP_MASK_TAMPER : LL_TAMP_MASK_NONE)

/**
  * @brief Helper macro to retrieve the mode of the internal tamper.
  * @param itamp_config_indiv_value Value returned by @ref LL_TAMP_GetConfigInternalTampers
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_TAMP_ITAMP_ERASE_ACTIVE_ALL
  *         @arg @ref LL_TAMP_ITAMP_NOERASE_TAMPER
  */
#define LL_TAMP_INTERNAL_GET_NOERASE(itamp_config_indiv_value) ((((itamp_config_indiv_value) &\
                                                                  LL_TAMP_ITAMP_NOERASE_TAMPER_ALL) != 0U ) \
                                                                ? LL_TAMP_ITAMP_NOERASE_TAMPER : \
                                                                LL_TAMP_ITAMP_ERASE_ACTIVE_ALL)

/**
  * @brief Helper macro to retrieve the active filtering status.
  * @param atamp_config_value Value returned by @ref LL_TAMP_ATAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_ATAMP_FILTERING_DISABLE
  *        @arg @ref LL_TAMP_ATAMP_FILTERING_ENABLE
  */
#define LL_TAMP_ACTIVE_GET_FILTER(atamp_config_value) ((atamp_config_value) & TAMP_ATCR1_FLTEN)

/**
  * @brief Helper macro to retrieve the period when the output signals changes.
  * @param atamp_config_value Value returned by @ref LL_TAMP_ATAMP_GetConfig
  * @retval Return value is between 0 and 7.
  */
#define LL_TAMP_ACTIVE_GET_OUTPUT_PERIOD(atamp_config_value) (((atamp_config_value) &\
                                                               TAMP_ATCR1_ATPER) >> TAMP_ATCR1_ATPER_Pos)

/**
  * @brief Helper macro to retrieve the asysnchronous prescaler.
  * @param atamp_config_value Value returned by @ref LL_TAMP_ATAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_4
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_8
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_16
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_32
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_64
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_128
  *        @arg @ref LL_TAMP_ATAMP_ASYNCPRES_RTCCLK_2048
  */
#define LL_TAMP_ACTIVE_GET_PRESCALER(atamp_config_value) ((atamp_config_value) & TAMP_ATCR1_ATCKSEL)

/**
  * @brief Helper macro to retrieve the sharing status of the active tampers
  * @param atamp_config_value Value returned by @ref LL_TAMP_ATAMP_GetConfig
  * @retval Return value can be one of the following values:
  *        @arg @ref LL_TAMP_ATAMP_SHARING_DISABLE
  *        @arg @ref LL_TAMP_ATAMP_SHARING_ENABLE
  */
#define LL_TAMP_ACTIVE_GET_SHARING(atamp_config_value) ((atamp_config_value) & TAMP_ATCR1_ATOSHARE)

/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup TAMP_LL_Exported_Functions TAMP Exported Functions
  * @{
  */

/** @defgroup TAMP_LL_EF_Tamper Tamper
  * @{
  */

/**
  * @brief  Enable TAMPx input detection
  * @rmtoll
  *  TAMP_CR1       TAMPxE        LL_TAMP_Enable
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_Enable(uint32_t Tampers)
{
  SET_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Clear TAMPx input detection
  * @rmtoll
  *  TAMP_CR1       TAMPxE         LL_TAMP_Disable
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_Disable(uint32_t Tampers)
{
  CLEAR_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Get TAMPx that are enabled
  * @rmtoll
  *  TAMP_CR1       TAMPxE         LL_TAMP_GetEnabled
  * @param  Tampers
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER
  * @retval State of the tampers enable.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetEnabled(uint32_t Tampers)
{
  return READ_BIT(TAMP->CR1, Tampers);
}

/**
  * @brief  Enable TAMPx interruption
  * @rmtoll
  *  TAMP_IER       TAMPxIE       LL_TAMP_EnableIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_EnableIT(uint32_t TampersIT)
{
  SET_BIT(TAMP->IER, TampersIT);
}

/**
  * @brief  Disable TAMPx interruption
  * @rmtoll
  *  TAMP_IER       TAMPxIE       LL_TAMP_DisableIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  */
__STATIC_INLINE void LL_TAMP_DisableIT(uint32_t TampersIT)
{
  CLEAR_BIT(TAMP->IER, TampersIT);
}

/**
  * @brief  Get TAMPx interruption that are enabled.
  * @rmtoll
  *  TAMP_IER       TAMPxIE        LL_TAMP_IsEnabledIT
  * @param  TampersIT
  *         This parameter can be a combination of the group values @ref TAMP_LL_EC_TAMPER_IT
  * @retval State of the tampers interruption enable (1 enabled / 0 disabled).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledIT(uint32_t TampersIT)
{
  return ((READ_BIT(TAMP->IER, TampersIT) == (TampersIT)) ? 1UL : 0UL);

