STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_tamp.h
/**
  * @brief  Get active tamper seed running status flag.
  * @rmtoll
  *  TAMP_ATOR      SEEDF         LL_TAMP_IsActiveFlag_ATAMP_SEEDF
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_ATAMP_SEEDF(void)
{
  return ((READ_BIT(TAMP->ATOR, TAMP_ATOR_SEEDF) == (TAMP_ATOR_SEEDF)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Backup_Registers Backup_Registers
  * @{
  */

/**
  * @brief  Writes a data in a specified Backup data register.
  * @rmtoll
  *  TAMP_BKPxR        BKP           LL_TAMP_BKP_SetRegister
  * @param  BackupRegister This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @param  Data Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE void LL_TAMP_BKP_SetRegister(uint32_t BackupRegister, uint32_t Data)
{
  uint32_t tmp;

  tmp = (uint32_t)(&(TAMP->BKP0R));
  tmp += (BackupRegister * 4U);

  /* Write the specified register */
  *(__IO uint32_t *)tmp = (uint32_t)Data;
}

/**
  * @brief  Reads data from the specified TAMP Backup data Register.
  * @rmtoll
  *  TAMP_BKPxR        BKP           LL_TAMP_BKP_GetRegister
  * @param  BackupRegister This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @retval Value between Min_Data=0x00 and Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_TAMP_BKP_GetRegister(uint32_t BackupRegister)
{
  uint32_t tmp;

  tmp = (uint32_t)(&(TAMP->BKP0R));
  tmp += (BackupRegister * 4U);

  /* Read the specified register */
  return (*(__IO uint32_t *)tmp);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Get tampers interrupt flags.
  * @rmtoll
  *  TAMP_SR          TAMPx       LL_TAMP_IsActiveFlag_TAMP
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_TAMP(uint32_t Tampers)
{
  return ((READ_BIT(TAMP->SR, Tampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get internal tampers interrupt flags.
  * @rmtoll
  *  TAMP_SR          ITAMPx       LL_TAMP_IsActiveFlag_ITAMP
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_ITAMP(uint32_t InternalTampers)
{
  return ((READ_BIT(TAMP->SR, InternalTampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_MISR          TAMPxMF       LL_TAMP_IsActiveFlag_TAMPM
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_TAMPM(uint32_t Tampers)
{
  return ((READ_BIT(TAMP->MISR, Tampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get internal tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_MISR          ITAMPxMF       LL_TAMP_IsActiveFlag_ITAMPM
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsActiveFlag_ITAMPM(uint32_t InternalTampers)
{
  return ((READ_BIT(TAMP->MISR, InternalTampers) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Clear tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_SCR          CTAMPxF       LL_TAMP_ClearFlag_TAMP
  * @param Tampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_TAMPER
  */
__STATIC_INLINE void LL_TAMP_ClearFlag_TAMP(uint32_t Tampers)
{
  WRITE_REG(TAMP->SCR, Tampers);
}

/**
  * @brief  Clear internal tampers interrupt masked flags.
  * @rmtoll
  *  TAMP_SCR          CITAMPxF       LL_TAMP_ClearFlag_ITAMP
  * @param InternalTampers This parameter can be a combination of the following values:
  *        @arg @ref TAMP_LL_EC_INTERNAL
  */
__STATIC_INLINE void LL_TAMP_ClearFlag_ITAMP(uint32_t InternalTampers)
{
  WRITE_REG(TAMP->SCR, InternalTampers);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_SECURITY SECURITY_Management
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Enable TAMPER secure level.
  * @rmtoll
  *  TAMP_SECCFGR          TAMPSEC           LL_TAMP_EnableTampSecure
  */
__STATIC_INLINE void LL_TAMP_EnableTampSecure(void)
{
  SET_BIT(TAMP->SECCFGR, TAMP_SECCFGR_TAMPSEC);
}

/**
  * @brief  Disable TAMPER secure level.
  * @rmtoll
  *  TAMP_SECCFGR          TAMPSEC           LL_TAMP_DisableTampSecure
  */
__STATIC_INLINE void LL_TAMP_DisableTampSecure(void)
{
  CLEAR_BIT(TAMP->SECCFGR, TAMP_SECCFGR_TAMPSEC);
}

#endif /* #if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Check if  TAMPER secure level is enabled.
  * @rmtoll
  *  TAMP_SECCFGR          TAMPSEC           LL_TAMP_IsEnabledTampSecure
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledTampSecure(void)
{
  return ((READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_TAMPSEC) == (TAMP_SECCFGR_TAMPSEC)) ? 1UL : 0UL);
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

/**
  * @brief  Enable Monotonic counter 1 secure level.
  * @rmtoll
  *  TAMP_SECCFGR          CNT1SEC           LL_TAMP_EnableMonotonicCounter1Secure
  */
__STATIC_INLINE void LL_TAMP_EnableMonotonicCounter1Secure(void)
{
  SET_BIT(TAMP->SECCFGR, TAMP_SECCFGR_CNT1SEC);
}

/**
  * @brief  Disable Monotonic counter 1 secure level.
  * @rmtoll
  *  TAMP_SECCFGR          CNT1SEC           LL_TAMP_DisableMonotonicCounter1Secure
  */
__STATIC_INLINE void LL_TAMP_DisableMonotonicCounter1Secure(void)
{
  CLEAR_BIT(TAMP->SECCFGR, TAMP_SECCFGR_CNT1SEC);
}
#endif /* #if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Check if  TAMPER secure level is enabled.
  * @rmtoll
  *  TAMP_SECCFGR          CNT1SEC           LL_TAMP_IsEnabledMonotonicCounter1Secure
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledMonotonicCounter1Secure(void)
{
  return ((READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_CNT1SEC) == (TAMP_SECCFGR_CNT1SEC)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_PRIVILEGE PRIVILEGE_Management
  * @{
  */

/**
  * @brief  Enable TAMPER privilege
  * @rmtoll
  *  TAMP_PRIVCFGR          TAMPPRIV           LL_TAMP_SetTampPrivilege
  */
__STATIC_INLINE void LL_TAMP_EnableTampPrivilege(void)
{
  SET_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_TAMPPRIV);
}

/**
  * @brief  Disable TAMPER privilege
  * @rmtoll
  *  TAMP_PRIVCFGR          TAMPPRIV           LL_TAMP_DisableTampPrivilege
  */
__STATIC_INLINE void LL_TAMP_DisableTampPrivilege(void)
{
  CLEAR_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_TAMPPRIV);
}

/**
  * @brief  Get TAMPER privilege level.
  * @rmtoll
  *  TAMP_PRIVCFGR          TAMPPRIV           LL_TAMP_IsEnabledTampPrivilege
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledTampPrivilege(void)
{
  return ((READ_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_TAMPPRIV) == (TAMP_PRIVCFGR_TAMPPRIV)) ? 1UL : 0UL);
}
/**
  * @brief  Enable Monotonic counter 1 privilege level.
  * @rmtoll
  *  TAMP_PRIVCFGR          CNT1PRIV           LL_TAMP_EnableMonotonicCounter1Privilege
  */
__STATIC_INLINE void LL_TAMP_EnableMonotonicCounter1Privilege(void)
{
  SET_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_CNT1PRIV);
}

/**
  * @brief  Disable Monotonic counter 1 privilege level.
  * @rmtoll
  *  TAMP_PRIVCFGR          CNT1SEC           LL_TAMP_DisableMonotonicCounter1Privilege
  */
__STATIC_INLINE void LL_TAMP_DisableMonotonicCounter1Privilege(void)
{
  CLEAR_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_CNT1PRIV);
}

/**
  * @brief  Check if  TAMPER Privilege level is enabled.
  * @rmtoll
  *  TAMP_PRIVCFGR          CNT1SEC           LL_TAMP_IsEnabledMonotonicCounter1Privilege
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledMonotonicCounter1Privilege(void)
{
  return ((READ_BIT(TAMP->PRIVCFGR, TAMP_PRIVCFGR_CNT1PRIV) == (TAMP_PRIVCFGR_CNT1PRIV)) ? 1UL : 0UL);
}

/**
  * @brief  Set Backup Registers privilege level.
  * @note   BackupRegisterPrivilege is only writable in secure mode or if trustzone is disabled
  * @rmtoll
  *  TAMP_PRIVCFGR          BKPWPRIV           LL_TAMP_SetBackupRegisterPrivilege \n
  *  TAMP_PRIVCFGR          BKPRWPRIV          LL_TAMP_SetBackupRegisterPrivilege
  * @param  BackupRegisterPrivilege This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_NONE
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_1
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_2
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_ALL
  */
__STATIC_INLINE void LL_TAMP_SetBackupRegisterPrivilege(uint32_t BackupRegisterPrivilege)
{
  MODIFY_REG(TAMP->PRIVCFGR, (TAMP_PRIVCFGR_BKPWPRIV | TAMP_PRIVCFGR_BKPRWPRIV), BackupRegisterPrivilege);
}

/**
  * @brief  Get Backup Registers privilege level.
  * @rmtoll
  *  TAMP_PRIVCFGR          BKPWPRIV           LL_TAMP_GetBackupRegisterPrivilege \n
  *  TAMP_PRIVCFGR          BKPRWPRIV          LL_TAMP_GetBackupRegisterPrivilege
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_NONE
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_1
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_2
  *         @arg @ref LL_TAMP_PRIVILEGE_BKUP_ZONE_ALL
  */
__STATIC_INLINE uint32_t LL_TAMP_GetBackupRegisterPrivilege(void)
{
  return READ_BIT(TAMP->PRIVCFGR, (TAMP_PRIVCFGR_BKPWPRIV | TAMP_PRIVCFGR_BKPRWPRIV));
}

/**
  * @}
  */

/** @defgroup TAMP_LL_EF_BACKUP_REG_PROTECTION PROTECTION_BACKUP_REG_Management
  * @{
  */

/**
  * @brief  Set Backup registers protection level.
  * @note   Zone 1 : read protection write protection
  * @note   Zone 2 : read non-protection  write protection
  * @note   Zone 3 : read non-protection  write non-protection
  * @note   Zone 1 : start from 0 to startZone2 start value
  * @note   Zone 2 : start from startZone2 start value to startZone3 start value
  * @note   Zone 3 : start from to startZone3 to the end of BACKUPREG
  * @note   Warning : this parameter is only writable in secure mode or if trustzone is disabled
  * @rmtoll
  *  TAMP_SECCFGR          BKPWSEC           LL_TAMP_SetBackupRegProtection \n
  *  TAMP_SECCFGR          BKPRWSEC          LL_TAMP_SetBackupRegProtection
  * @param  startZone2 This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  * @param  startZone3 This parameter can be one of the group values @ref TAMP_LL_EC_BKP
  */
__STATIC_INLINE void LL_TAMP_SetBackupRegProtection(uint32_t startZone2, uint32_t startZone3)
{
  MODIFY_REG(TAMP->SECCFGR, (TAMP_SECCFGR_BKPRWSEC_Msk | TAMP_SECCFGR_BKPWSEC_Msk), \
             (startZone2 << TAMP_SECCFGR_BKPRWSEC_Pos) | (startZone3 << TAMP_SECCFGR_BKPWSEC_Pos));
}

/**
  * @brief  Get Backup registers protection level start zone 2.
  * @note   Zone 1 : read protection write protection
  * @note   Zone 2 : read non-protection  write protection
  * @note   Zone 3 : read non-protection  write non-protection
  * @rmtoll
  *  TAMP_SECCFGR          BKPRWSEC         LL_TAMP_GetBackupRegProtectionStartZone2
  * @retval Start zone 2
  */
__STATIC_INLINE uint32_t LL_TAMP_GetBackupRegProtectionStartZone2(void)
{
  return READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_BKPRWSEC_Msk) >> TAMP_SECCFGR_BKPRWSEC_Pos;
}

/**
  * @brief  Get Backup registers protection level start zone 3.
  * @note   Zone 1 : read protection write protection
  * @note   Zone 2 : read non-protection  write protection
  * @note   Zone 3 : read non-protection  write non-protection
  * @rmtoll
  *  TAMP_SECCFGR          BKPWSEC           LL_TAMP_GetBackupRegProtectionStartZone3
  * @retval Start zone 3
  */
__STATIC_INLINE uint32_t LL_TAMP_GetBackupRegProtectionStartZone3(void)
{
  return READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_BKPWSEC_Msk) >> TAMP_SECCFGR_BKPWSEC_Pos;
}
/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Device_Secret_Management Device_Secret Management
  * @{
  */

/**
  * @brief Block access to the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_BlockDeviceSecretsAccess
  */
__STATIC_INLINE void LL_TAMP_BlockDeviceSecretsAccess(void)
{
  SET_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK);
}

/**
  * @brief Unblock access to the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_UnblockDeviceSecretsAccess
  */
__STATIC_INLINE void LL_TAMP_UnblockDeviceSecretsAccess(void)
{
  CLEAR_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK);
}

/**
  * @brief Check if the access to the backup registers and devices secrets is blocked.
  * @rmtoll
  *  TAMP_CR2      BKBLOCK    LL_TAMP_IsBlockedDeviceSecretsAccess
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsBlockedDeviceSecretsAccess(void)
{
  return ((READ_BIT(TAMP->CR2, TAMP_CR2_BKBLOCK) == (TAMP_CR2_BKBLOCK)) ? 1UL : 0UL);
}

/**
  * @brief Erase the backup registers and device secrets.
  * @rmtoll
  *  TAMP_CR2      BKERASE    LL_TAMP_EraseDeviceSecrets
  */
__STATIC_INLINE void LL_TAMP_EraseDeviceSecrets(void)
{
  SET_BIT(TAMP->CR2, TAMP_CR2_BKERASE);
}

/**
  * @brief Enable protection by TAMP peripheral of the device secrets.
  * @rmtoll
  *  TAMP_ERCFGR      ERCFGx    LL_TAMP_EnableResourceProtection
  * @param Resources can be a combination of the group values @ref TAMP_LL_EC_RESOURCE_PROTECTION
  */
__STATIC_INLINE void LL_TAMP_EnableResourceProtection(uint32_t Resources)
{
  SET_BIT(TAMP->ERCFGR, Resources);
}

/**
  * @brief Disable protection by TAMP peripheral of the device secrets.
  * @rmtoll
  *  TAMP_ERCFGR      ERCFGx    LL_TAMP_DisableResourceProtection
  * @param Resources can be a combination of the group values @ref TAMP_LL_EC_RESOURCE_PROTECTION
  */
__STATIC_INLINE void LL_TAMP_DisableResourceProtection(uint32_t Resources)
{
  CLEAR_BIT(TAMP->ERCFGR, Resources);
}

/**
  * @brief Check if the protection by TAMP peripheral of the device secret is enabled.
  * @rmtoll
  *  TAMP_ERCFGR      ERCFGx    LL_TAMP_IsEnabledResourceProtection
  * @param Resources can be a combination of the group values @ref TAMP_LL_EC_RESOURCE_PROTECTION
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledResourceProtection(uint32_t Resources)
{
  return ((READ_BIT(TAMP->ERCFGR, Resources) == (Resources)) ? 1UL : 0UL);
}

/**
  * @brief  Blocks access to the eight first backup registers corresponding to the hardware boot key.
  * @rmtoll
  *  TAMP_SECCFGR      BHKLOCK    LL_TAMP_EnableHardwareBootkeyBlock
  */
__STATIC_INLINE void LL_TAMP_EnableHardwareBootkeyBlock(void)
{
  SET_BIT(TAMP->SECCFGR, TAMP_SECCFGR_BHKLOCK);
}

/**
  * @brief Check if the eight first backup registers corresponding to the hardware boot key are blocked.
  * @rmtoll
  *  TAMP_SECCFGR      BHKLOCK    LL_TAMP_IsEnabledHardwareBootkeyBlock
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_TAMP_IsEnabledHardwareBootkeyBlock(void)
{
  return ((READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_BHKLOCK) == (TAMP_SECCFGR_BHKLOCK)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup TAMP_LL_EF_Monotonic_Counter Monotonic Counter
  * @{
  */

/**
  * @brief  Increment Monotonic counter.
  * @rmtoll
  *  TAMP_COUNTR         COUNT        LL_TAMP_IncrementMonotonicCounter1
  */
__STATIC_INLINE void LL_TAMP_IncrementMonotonicCounter1(void)
{
  WRITE_REG(TAMP->COUNTR, 0U);
}

/**
  * @brief  Increment Monotonic counter.
  * @rmtoll
  *  TAMP_COUNTR         COUNT        LL_TAMP_GetMonotonicCounter1
  * @retval Monotonic counter value.
  */
__STATIC_INLINE uint32_t LL_TAMP_GetMonotonicCounter1(void)
{
  return READ_REG(TAMP->COUNTR);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(TAMP) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5XX_LL_TAMP_H */
